Revit 2024 API
DuctPressureDropData.Viscosity Property
 The viscosity of the duct. Units: (kg/(ft·s)).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double Viscosity { get; }
Visual Basic
Public ReadOnly Property Viscosity As Double
	Get
Visual C++
public:
property double Viscosity {
	double get ();
}
See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace